#+TITLE: Cahier des charges - Scénarios d'usage

* Légende pour les colonnes

- "C" : Chiffrage actency
- "?" : demande de compréhension JDS sur le chiffrage
- "R" : accord JDS pour rescopage
- "N" : nouveau scope proposé par JDS
- "P" : priorité pour les itérations agiles	

* Utilisateurs

| Je peux …                                                                              | afin de …                                      | Chiffrage | ? | R |     N | P |
|----------------------------------------------------------------------------------------+------------------------------------------------+-----------+---+---+-------+---|
| accéder à une page d'accueil qui présente l'actualité                                  | être tenu au courant des derniers contenus     |        56 | ? |   |    56 |   |
| accéder à une page consacrée à un contenu (billets / dossiers / diaporamas / vidéos …) | le consulter                                   |      83.5 | ? |   |  83.5 |   |
| connaître les éléments connexes grâce à un algorithme qui me suggère d'autres contenus | explorer par association                       |         8 |   |   |     8 |   |
| voir la liste des contributeurs d'un dossier ou d'un parcours                          | explorer par association                       |         2 |   |   |     2 |   |
|----------------------------------------------------------------------------------------+------------------------------------------------+-----------+---+---+-------+---|
| faire une recherche par mots-clés                                                      | accéder à la liste/carte des résultats         |        20 |   |   |    20 |   |
| faire une recherche par thématique                                                     | accéder à la liste/carte des résultats         |         0 |   |   |     0 |   |
| faire une recherche par type de contenus                                               | accéder à la liste/carte des résultats         |         0 |   |   |     0 |   |
| faire une recherche avancée (filtres / facettes)                                       | trouver un résultat précis                     |         0 |   |   |     0 |   |
| trier les résultats par ordre chronologique                                            | connaître les ajouts récents                   |         0 |   |   |     0 |   |
|----------------------------------------------------------------------------------------+------------------------------------------------+-----------+---+---+-------+---|
| voir les réponses à un sondage                                                         | explorer les sondages                          |         4 |   | X |     0 |   |
| télécharger chacun des contenus (fichier zip pour contenus avec plusieurs éléments)    | explorer un contenu hors ligne                 |        40 |   | X |     0 |   |
| imprimer un billet ou une image                                                        | le/la lire sur papier                          |         9 |   |   |     9 |   |
| accéder à un tutoriel pour m'expliquer comment contribuer                              | avoir envie de me créer un compte              |         2 |   |   |     2 |   |
| partager un contenu sur les réseaux sociaux (Facebook, Twitter)                        | le faire connaître                             |         4 | ? |   |     4 |   |
| m'abonner au flux RSS d'une thématique                                                 | organiser ma veille                            |         4 | ? | X |     0 |   |
|----------------------------------------------------------------------------------------+------------------------------------------------+-----------+---+---+-------+---|
| me créer un compte comme contributeur par email                                        | me connecter et pouvoir contribuer             |         8 | ? |   |     8 |   |
| me créer un compte comme contributeur avec ma connexion Facebook                       | me connecter et pouvoir contribuer             |         0 |   |   |     0 |   |
| me créer un compte comme contributeur avec ma connexion Twitter                        | me connecter et pouvoir contribuer             |         0 |   |   |     0 |   |
| valider mon profil en cliquant sur un email de validation quand je m'inscris par mail  | alléger la modération manuelle pour les admins |         0 |   |   |     0 |   |
|----------------------------------------------------------------------------------------+------------------------------------------------+-----------+---+---+-------+---|
| lire les recommandations juridiques du site                                            | être informé de mes droits et devoirs          |         4 | ? |   |     4 |   |
| lire les recommandations techniques du site : définition optimale, recadrage, etc      | être informé des bonnes pratiques              |         0 |   |   |     0 |   |
|----------------------------------------------------------------------------------------+------------------------------------------------+-----------+---+---+-------+---|
| voir les badges d'un contributeur                                                      | savoir comment il contribue                    |           |   |   |     0 |   |
| filtrer les contenus par droits                                                        | accéder à des contenus libres                  |           |   |   |     0 |   |
| signaler un problème de droits d'auteur                                                | contribuer à améliorer le site                 |           |   |   |     0 |   |
| signaler un problème technique                                                         | contribuer à améliorer le site                 |           |   |   |     0 |   |
| signaler un problème de contenu inapproprié                                            | contribuer à améliorer le site                 |           |   |   |     0 |   |
| Interroger un sparql endpoint pour accéder aux données contribuées                     | Intégrer ses données hors de la plate-forme    |           |   |   |     0 |   |
|----------------------------------------------------------------------------------------+------------------------------------------------+-----------+---+---+-------+---|
|                                                                                        |                                                |     244.5 |   |   | 196.5 |   |
#+TBLFM: @29$3=vsum(@2..@-1)::@29$6=vsum(@2..@-1)

* Contributeurs

** Gérer son profil

| Je peux …                                                    | afin de …                                             | Chiffrage | ? | R |  N | P |
|--------------------------------------------------------------+-------------------------------------------------------+-----------+---+---+----+---|
| mettre à jour mon profil                                     | corriger des informations me concernant               |         3 | ? |   |  3 |   |
| cacher mon compte                                            | pouvoir le réactiver plus tard mais devenir invisible |         6 |   | X |  0 |   |
| effacer tous mes commentaires                                | garder la maîtrise de mes contenus secondaires        |         8 | ? |   |  8 |   |
| effacer mon compte*                                          | garder la maîtrise des informations me concernant     |         1 |   |   |  1 |   |
| choisir le mode de réception des notifications               | gérer l'information en "push"                         |         4 |   |   |  4 |   |
| voir l'état d'avancement de mes dossiers en %                | me motiver pour continuer                             |         8 |   | X |  0 |   |
| indiquer si OK pour être contacté par d'autres contributeurs |                                                       |           |   |   |  0 |   |
|--------------------------------------------------------------+-------------------------------------------------------+-----------+---+---+----+---|
|                                                              |                                                       |        30 |   |   | 16 |   |
#+TBLFM: @9$3=vsum(@2..@-1)::@9$6=vsum(@2..@-1)

** Organiser sa veille

| Je peux …                                                              | afin de …                                    | Chiffrage | ? | R |  N | P |
|------------------------------------------------------------------------+----------------------------------------------+-----------+---+---+----+---|
| accéder au classement des 10 contributeurs les plus actifs             | organiser sa veille                          |         4 |   |   |  4 |   |
| accéder au classement des 10 derniers commentaires                     | organiser sa veille                          |         4 | ? |   |  4 |   |
| accéder au classement des 10 contributions les plus commentées         | organiser sa veille                          |         4 |   | X |  0 |   |
| suivre un contributeur                                                 | organiser ma veille                          |         8 |   |   |  8 |   |
| suivre une thématique                                                  | organiser ma veille                          |        12 | ? |   | 12 |   |
| recevoir des notifications lors de commentaires sur mes contributions  | suivre mes contributions                     |         4 |   |   |  4 |   |
| voir une liste de l'ensemble de mes contributions                      | suivre mes contributions                     |        11 | ? |   | 11 |   |
|------------------------------------------------------------------------+----------------------------------------------+-----------+---+---+----+---|
| télécharger un contenu dans son format natif (pdf/jpg/png etc.)        | consulter les contenus hors-ligne            |         0 |   |   |  0 |   |
| créer une ou plusieurs liste(s) de suivi                               | organiser ma veille                          |        16 | ? |   | 16 |   |
| ajouter un contenu à une liste de suivi                                | organiser ma veille                          |        16 |   | X |  0 |   |
| partager une liste de suivi publiquement                               | partager ma veille                           |        16 |   | X |  0 |   |
| partager une liste de suivi avec ceux qui me suivent                   | partager ma veille et encourager à me suivre |        16 |   | X |  0 |   |
| gérer mes listes de suivi (renommer, explorer, recherche, suppression) | organiser ma veille                          |        16 |   | X |  0 |   |
| créer un dossier à partir d'éléments d'une liste de suivi              | inciter à créer des dossiers                 |        16 |   |   | 16 |   |
|------------------------------------------------------------------------+----------------------------------------------+-----------+---+---+----+---|
| avoir mes contributions automatiquement ajoutées à ma liste de suivi   | organiser ma veille                          |           |   |   |    |   |
| Voir mes badges                                                        | savoir où j'en suis                          |           |   |   |    |   |
|------------------------------------------------------------------------+----------------------------------------------+-----------+---+---+----+---|
|                                                                        |                                              |       143 |   |   | 75 |   |
#+TBLFM: @18$3=vsum(@2..@-1)::@18$6=vsum(@2..@-1)

** Contribuer

| Je peux …                                                      | afin de …                                                 | Chiffrage | ? | R |     N | P |
|----------------------------------------------------------------+-----------------------------------------------------------+-----------+---+---+-------+---|
| créer un parcours                                              | organiser des éléments dans le temps et l'espace          |        54 | ? |   |    54 |   |
| créer un QCM                                                   | enrichir la plate-forme                                   |         2 |   | X |     0 |   |
| créer un sondage                                               | enrichir la plate-forme                                   |         2 |   | X |     0 |   |
| créer un événement                                             | enrichir la plate-forme                                   |        11 | ? |   |    11 |   |
| créer une entrée de glossaire                                  | enrichir la plate-forme                                   |         2 |   |   |     2 |   |
| à la publication d'un dossier, forcer la création d'un edito   | obliger à créer un edito pour les dossiers                |         2 |   |   |     2 |   |
| en créant un dossier, chercher et choisir ses contenus WYSIWYG | faciliter le rassemblement des contenus pour les dossiers |         8 |   |   |     8 |   |
| protéger l'accès à un contenu par mot de passe                 | partager ce contenu de façon confidentielle               |         6 | ? |   |     6 |   |
| définir la modération a priori ou a posteriori pour un dossier | indiquer le mode de contribution accepté                  |        16 | ? |   |    16 |   |
| commenter les billets, dossiers, diaporamas, parcours          | donner son avis / enrichir une discussion                 |         3 |   |   |     3 |   |
| ajouter un tag/commentaire à un visuel à un endroit précis     | enrichir le visuel de façon précise                       |        16 |   | X |     0 |   |
| tagger un contenu texte en surlignant un passage du texte      | enrichir le contenu texte de façon précise                |        32 |   | X |     0 |   |
| contacter un contributeur                                      | échanger avec lui directement                             |       2.5 |   |   |   2.5 |   |
| signaler un problème scientifique                              | contribuer à améliorer le site                            |           |   |   |       |   |
| signaler un problème sur un commentaire                        | contribuer à améliorer le site                            |           |   |   |       |   |
| voir les contenus signalés comme problématiques                | intervenir pour résoudre ces problèmes                    |           |   |   |       |   |
| importer un document .docx ou .odt comme billet                | pouvoir travailler hors-ligne                             |           |   |   |       |   |
| le contributeur reconnaît qu'il sait ce qu'il fait re. droits  | s'assurer que l'utilisateur connaît les droits            |           |   |   |       |   |
|----------------------------------------------------------------+-----------------------------------------------------------+-----------+---+---+-------+---|
|                                                                |                                                           |     156.5 |   |   | 104.5 |   |
#+TBLFM: @20$3=vsum(@2..@-1)::@20$6=vsum(@2..@-1)

** Partager

| Je peux …                                                          | afin de …                       | Chiffrage | ? | R |  N | P |
|--------------------------------------------------------------------+---------------------------------+-----------+---+---+----+---|
| partager un contenu que je viens d'ajouter sur les réseaux sociaux | faire savoir que je contribue   |         3 | ? |   |  3 |   |
| partager un résultat (badge) obtenu via gamification               | faire savoir que je joue        |        32 |   | X |  0 |   |
| interagir via un forum                                             | partager mes interrogations     |        40 |   | X |  0 |   |
| signaler un problème sur un contenu (par ex: droits d'auteur)      | aider les administrateurs       |         4 |   |   |  4 |   |
| soumettre un dossier pour qu'il soit en une                        | signaler un dossier intéressant |         8 | ? |   |  8 |   |
|--------------------------------------------------------------------+---------------------------------+-----------+---+---+----+---|
|                                                                    |                                 |        87 |   |   | 15 |   |
#+TBLFM: @7$3=vsum(@2..@-1)::@7$6=vsum(@2..@-1)

* Administrateurs

| Je peux …                                                       | afin de …                                                | Chiffrage | ? | R |  N | P |
|-----------------------------------------------------------------+----------------------------------------------------------+-----------+---+---+----+---|
| me connecter comme administrateur                               | gérer des contenus et utilisateurs                       |         0 |   |   |  0 |   |
| accéder au back office                                          | avoir une vue d'ensemble de l'activité de la plate-forme |         0 |   |   |  0 |   |
| voir tous les imports                                           | m'assurer qu'il n'y a pas de bugs                        |         0 |   |   |  0 |   |
| faire un nouvel import Gertrude                                 | mettre à jour les données ou les enrichir                |         0 |   |   |  0 |   |
| éditer un contenu : le modifier, le bloquer, changer mdp, etc.  | aider les contributeurs                                  |         0 |   |   |  0 |   |
| éditer un utilisateur (modifier, bloquer, etc.)                 | aider les contributeurs                                  |         0 |   |   |  0 |   |
| modérer les commentaires en attente de modération un par un     | aider les contributeurs                                  |         4 | ? |   |  4 |   |
|-----------------------------------------------------------------+----------------------------------------------------------+-----------+---+---+----+---|
| voir tous les contenus signalés comme problématiques            | intervenir pour résoudre ces problèmes                   |         8 |   |   |  8 |   |
| voir le nombre de contributeurs connectés en temps réel         | accéder à des statistiques                               |         2 |   |   |  2 |   |
| voir les 10 dernières contributions                             | accéder à des statistiques                               |         2 |   |   |  2 |   |
| voir les 10 contenus les plus consultés                         | accéder à des statistiques                               |         2 |   |   |  2 |   |
| voir les 10 dossiers avec le plus grand nombre de contributeurs | accéder à des statistiques                               |         2 |   |   |  2 |   |
| voir l'état d'avancement de tous les dossiers                   | intervenir pour aider à avancer                          |         2 |   |   |  2 |   |
| répartition des consultations par thème                         | accéder à des statistiques                               |        16 |   | X |  0 |   |
| répartition des abonnés par thème                               | accéder à des statistiques                               |        16 |   | X |  0 |   |
| répartition des contributions par thème                         | accéder à des statistiques                               |        16 | ? |   | 16 |   |
|-----------------------------------------------------------------+----------------------------------------------------------+-----------+---+---+----+---|
| Voir les badges attribués                                       | connaître les types de contribution                      |           |   |   |    |   |
| Gérer les thématiques (CRUD)                                    | enrichir la plate-forme                                  |           |   |   |    |   |
| Gérer les disciplines (CRUD)                                    | enrichir la plate-forme                                  |           |   |   |    |   |
|-----------------------------------------------------------------+----------------------------------------------------------+-----------+---+---+----+---|
| importer depuis d'autres bases [à définir]                      |                                                          |           |   |   |    |   |
|                                                                 |                                                          |        70 |   |   | 38 |   |
#+TBLFM: @22$3=vsum(@2..@-1)::@22$6=vsum(@2..@-1)

* À partir des issues Github

| Issue # | Résumé               | Heures | ? | R |  N | Commentaire                         |
|---------+----------------------+--------+---+---+----+-------------------------------------|
| [[https://github.com/Jardin-des-Sciences/website/issues/28][#28]]     | WYSIWYG              |     24 | ? |   | 24 |                                     |
| [[https://github.com/Jardin-des-Sciences/website/issues/29][#29]]     | Import de documents  |    120 |   | X |  0 |                                     |
| [[https://github.com/Jardin-des-Sciences/website/issues/35][#35]]     | Nouvelles maquettes  |     24 | ? |   |  8 | Le chiffrage paraît exagéré         |
| [[https://github.com/Jardin-des-Sciences/website/issues/36][#36]]     | Type de contenu lien |     24 | ? | X |  0 |                                     |
| [[https://github.com/Jardin-des-Sciences/website/issues/31][#31]]     | viewerjs             |      8 | ? |   |  8 |                                     |
| [[https://github.com/Jardin-des-Sciences/website/issues/33][#33]]     | Accessibilité        |     16 | ? |   |  0 | Accessibilité comprise dans Drupal? |
|---------+----------------------+--------+---+---+----+-------------------------------------|
|         |                      |    216 |   |   | 40 |                                     |
#+TBLFM: @8$3=vsum(@2..@-1)::@8$6=vsum(@2..@-1)

* Projection du total de nombre de jours

| Partie          | Heures scope initial | Heures nouveau scope | Total jours |
|-----------------+----------------------+----------------------+-------------|
| Utilisateurs    |                244.5 |                196.5 |             |
| Contributeurs   |                416.5 |                210.5 |             |
| Administrateurs |                   70 |                   38 |             |
| Tickets Github  |                  216 |                   40 |             |
| "Leftovers"     |                   75 |                    0 |             |
|-----------------+----------------------+----------------------+-------------|
|                 |                1022. |                 485. |   69.285714 |
#+TBLFM: @7$2=vsum(@2..@-1)::@7$3=vsum(@2..@-1)::@7$4=$3/7

* Dans le doc Actency mais pas chez nous
  
| Qui            | Je peux...                                                             | Afin de...                                    |  C |
|----------------+------------------------------------------------------------------------+-----------------------------------------------+----|
| contributeur   | stat                                                                   |                                               |  8 |
| contributeur   | m’abonner à une thématique par email                                   | organiser ma veille                           |  0 |
| contributeur   | m’abonner via mon inbox à une thématique                               | personnaliser ma navigation                   |  4 |
| contributeur   | être notifié quand un contributeur que je suis contribue               | organiser ma veille                           |  4 |
| contributeur   | être notifié quand une thématique que je suis s’enrichit               | organiser ma veille                           |  4 |
| contributeur   | envoyer une notification aux abonnés d’une thématique concernée        | communiquer entre pairs                       | 32 |
| administrateur | visualiser les contenus en attente de contributions                    | anticiper sur ce qui bloque pour ces contenus | 15 |
| administrateur | avoir une vue des statistiques type de contenu par type de contenu     |                                               |  4 |
| administrateur | retranscrire des noms, dates, chiffres, etc au travers d'un formulaire |                                               |  0 |
| utilisateur    | faire connaître le site à mes contacts                                 |                                               |  4 |
|----------------+------------------------------------------------------------------------+-----------------------------------------------+----|
|                |                                                                        |                                               | 75 |
#+TBLFM: @12$4=vsum(@2..@-1)

* User stories fusionnées

| Je peux …                                                              | afin de …                                                   |
|------------------------------------------------------------------------+-------------------------------------------------------------|
| voir rapidement les résultats visuels                                  | explorer les visuels                                        |
| partager un contenu par email                                          | le faire connaître                                          |
| créer un visuel en WYSIWYG / vidéo / fichier son                       | enrichir la plate-forme                                     |
| créer un billet et l'éditer en WYSIWYG                                 | enrichir la plate-forme                                     |
| créer un edito et l'éditer en WYSIWYG                                  | enrichir la plate-forme                                     |
| créer un diaporama et agencer l'ordre des diapos en WYSIWYG            | enrichir la plate-forme                                     |
| créer un dossier et choisir ses contenus en WYSIWYG                    | enrichir la plate-forme                                     |
| créer une question / réponse pour la FAQ                               | enrichir la plate-forme                                     |
| prévisualiser un commentaire avant de le publier                       | vérifier que le commentaire soumis à modération est correct |
| proposer un commentaire pour validation                                | soumettre le commentaire à la modération                    |
| modérer les commentaires en attente de modération d'un coup            | aider les contributeurs                                     |
| télécharger un dossier sous format zip (avec .html et fichiers images) | consulter les contenus hors-ligne                           |
| proposer de publier des photos sur une cartographie                    |                                                             |
